src/oy19_by21_pr15_bp9_mf11/conf/Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/AccumulationRegisters/ОстаткиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиНоменклатуры</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/InformationRegisters/АналогиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>АналогиТоваров</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГруппаАналогов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыАналогов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/AccountingRegisters/Проводки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccountingRegister>
		<Properties>
			<Name>Проводки</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Documents/УстановкаКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаКурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Проводки</xr:Item>
				<xr:Item>InformationRegister.КурсыВалют</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Курсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Курс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/oy19_by21_pr15_bp9_mf11/conf/Documents/РасходнаяНакладная/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
#Область ОПЕРАТИВНЫЙ_УЧЕТ
	НоменклатураПустаяСсылка = Справочники.Номенклатура.ПустаяСсылка();
	СуммаУслуг = 0;
	
	Движения.Продажи.Очистить();
	Движения.ОстаткиНоменклатуры.Очистить();
	
	Движения.Продажи.Записывать = Истина;
	Движения.ОстаткиНоменклатуры.Записывать = Истина;
	
	МоментВремени = ?(РежимПроведения = РежимПроведенияДокумента.Оперативный, Неопределено, Новый Граница(МоментВремени(), ВидГраницы.Исключая));
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Товары.Номенклатура.Вид <> ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)) КАК ЭтоТовар,
		|	СУММА(Товары.Количество) КАК Количество,
		|	СУММА(Товары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ втТЧ
		|ИЗ
		|	Документ.РасходнаяНакладная.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Товары.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	взГруппыАналогов.ГруппаАналогов КАК ГруппаАналогов,
		|	взГруппыАналогов.Номенклатура КАК Номенклатура,
		|	АналогиТоваровСрезПоследних.Номенклатура КАК Аналог,
		|	НоменклатураАналога.Артикул КАК АртикулАналога
		|ПОМЕСТИТЬ втАналоги
		|ИЗ
		|	(ВЫБРАТЬ
		|		АналогиТоваровСрезПоследних.Номенклатура КАК Номенклатура,
		|		АналогиТоваровСрезПоследних.ГруппаАналогов КАК ГруппаАналогов
		|	ИЗ
		|		РегистрСведений.АналогиТоваров.СрезПоследних(
		|				&Период,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						втТЧ.Номенклатура
		|					ИЗ
		|						втТЧ КАК втТЧ
		|					ГДЕ
		|						втТЧ.ЭтоТовар)) КАК АналогиТоваровСрезПоследних) КАК взГруппыАналогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналогиТоваров.СрезПоследних(&Период, ) КАК АналогиТоваровСрезПоследних
		|		ПО взГруппыАналогов.ГруппаАналогов = АналогиТоваровСрезПоследних.ГруппаАналогов
		|			И взГруппыАналогов.Номенклатура <> АналогиТоваровСрезПоследних.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК НоменклатураАналога
		|		ПО (АналогиТоваровСрезПоследних.Номенклатура = НоменклатураАналога.Ссылка)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТЧ.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ втТоварыИАналоги
		|ИЗ
		|	втТЧ КАК втТЧ
		|ГДЕ
		|	втТЧ.ЭтоТовар
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	втАналоги.Аналог
		|ИЗ
		|	втАналоги КАК втАналоги
		|
		|СГРУППИРОВАТЬ ПО
		|	втАналоги.Аналог
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТоварыИАналоги.Номенклатура КАК Номенклатура
		|ИЗ
		|	втТоварыИАналоги КАК втТоварыИАналоги"
	);
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиНоменклатуры");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Номенклатура", "Номенклатура");
	ЭлементБлокировки.УстановитьЗначение("Склад", Склад);
	Блокировка.Заблокировать();
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	втТЧ.ЭтоТовар КАК ЭтоТовар,
		|	втТЧ.Номенклатура КАК Номенклатура,
		|	втТЧ.Количество КАК Количество,
		|	втТЧ.Сумма КАК Сумма,
		|	ЕСТЬNULL(втАналоги.Аналог, НЕОПРЕДЕЛЕНО) КАК Аналог
		|ИЗ
		|	втТЧ КАК втТЧ
		|		ЛЕВОЕ СОЕДИНЕНИЕ втАналоги КАК втАналоги
		|		ПО втТЧ.Номенклатура = втАналоги.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	втАналоги.АртикулАналога
		|ИТОГИ
		|	МАКСИМУМ(ЭтоТовар),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Сумма)
		|ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОстаткиНоменклатурыОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиНоменклатурыОстатки.КоличествоОстаток КАК Остаток,
		|	ОстаткиНоменклатурыОстатки.СтоимостьОстаток КАК Стоимость
		|ИЗ
		|	РегистрНакопления.ОстаткиНоменклатуры.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						втТоварыИАналоги.Номенклатура
		|					ИЗ
		|						втТоварыИАналоги КАК втТоварыИАналоги)
		|				И Склад = &Склад) КАК ОстаткиНоменклатурыОстатки";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени);
	
	РезультатПакет = Запрос.ВыполнитьПакет();
	ИндексПоследнегоВПакете = РезультатПакет.Количество() - 1;
	
	ОстаткиТоваровИАналогов = Новый Соответствие;
	
	Выборка = РезультатПакет[ИндексПоследнегоВПакете].Выбрать();
	Пока Выборка.Следующий() Цикл
		ОстаткиТоваровИАналогов.Вставить(Выборка.Номенклатура, Новый Структура("Остаток, Стоимость", Выборка.Остаток, Выборка.Стоимость));
	КонецЦикла;
	
	ВыборкаНоменклатура = РезультатПакет[ИндексПоследнегоВПакете-1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
		Если НЕ ВыборкаНоменклатура.ЭтоТовар Тогда
			ДобавитьДвижениеПродажи(ВыборкаНоменклатура.Номенклатура, ВыборкаНоменклатура.Номенклатура, ВыборкаНоменклатура.Количество, ВыборкаНоменклатура.Сумма, 0);
			
			СуммаУслуг = СуммаУслуг + ВыборкаНоменклатура.Сумма;
			
			Продолжить;
		КонецЕсли;
		
		ОстаткиТовара = ОстаткиТоваровИАналогов.Получить(ВыборкаНоменклатура.Номенклатура);
		Если ОстаткиТовара = Неопределено Тогда
			ОстаткиТовара = Новый Структура("Остаток, Стоимость", 0, 0);
		КонецЕсли;
		
		ОсталосьСписать = ВыборкаНоменклатура.Количество;
		
		Если ОсталосьСписать <= ОстаткиТовара.Остаток Тогда
			Себестоимость = ?(ОсталосьСписать = ОстаткиТовара.Остаток, ОстаткиТовара.Стоимость, ОсталосьСписать / ОстаткиТовара.Остаток * ОстаткиТовара.Стоимость);
			
			ДобавитьДвижениеОстатки(ВыборкаНоменклатура.Номенклатура, ОсталосьСписать, Себестоимость);
			ДобавитьДвижениеПродажи(ВыборкаНоменклатура.Номенклатура, ВыборкаНоменклатура.Номенклатура, ВыборкаНоменклатура.Количество, ВыборкаНоменклатура.Сумма, Себестоимость);
			
			ОстаткиТовара.Остаток   = ОстаткиТовара.Остаток - ОсталосьСписать;
			ОстаткиТовара.Стоимость = ОстаткиТовара.Стоимость - Себестоимость;
		Иначе
			Если ОстаткиТовара.Остаток > 0 Тогда
				Себестоимость = ОстаткиТовара.Стоимость;
				СуммаПродажи = ОстаткиТовара.Остаток / ВыборкаНоменклатура.Количество * ВыборкаНоменклатура.Сумма;
				
				ДобавитьДвижениеОстатки(ВыборкаНоменклатура.Номенклатура, ОстаткиТовара.Остаток, Себестоимость);
				ДобавитьДвижениеПродажи(ВыборкаНоменклатура.Номенклатура, ВыборкаНоменклатура.Номенклатура, ОстаткиТовара.Остаток, СуммаПродажи, Себестоимость);
				
				ОсталосьСписать = ОсталосьСписать - ОстаткиТовара.Остаток;
				
				ОстаткиТовара.Остаток   = 0;
				ОстаткиТовара.Стоимость = 0;
			КонецЕсли;
			
			Выборка = ВыборкаНоменклатура.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если НЕ ЗначениеЗаполнено(Выборка.Аналог) Тогда
					Продолжить;
				КонецЕсли;
				
				ОстаткиТовара = ОстаткиТоваровИАналогов.Получить(Выборка.Аналог);
				Если ОстаткиТовара = Неопределено ИЛИ ОстаткиТовара.Остаток = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Списать = Мин(ОсталосьСписать, ОстаткиТовара.Остаток);
				Себестоимость = ?(Списать = ОстаткиТовара.Остаток, ОстаткиТовара.Стоимость, Списать / ОстаткиТовара.Остаток * ОстаткиТовара.Стоимость);
				СуммаПродажи = Списать / Выборка.Количество * Выборка.Сумма;
				
				ДобавитьДвижениеОстатки(Выборка.Аналог, Списать, Себестоимость);
				ДобавитьДвижениеПродажи(Выборка.Номенклатура, Выборка.Аналог, Списать, СуммаПродажи, Себестоимость);
				
				ОстаткиТовара.Остаток   = ОстаткиТовара.Остаток - Списать;
				ОстаткиТовара.Стоимость = ОстаткиТовара.Стоимость - Себестоимость;
				
				ОсталосьСписать = ОсталосьСписать - Списать;
				Если ОсталосьСписать = 0 Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ОсталосьСписать > 0 Тогда
				Отказ = Истина;
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не хватает товара %1 и его аналогов в количестве %2 штук", ВыборкаНоменклатура.Номенклатура, ОсталосьСписать - ОстаткиТовара.Остаток);
				Сообщение.Сообщить();
				
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
#КонецОбласти

#Область БУХГАЛТЕРСКИЙ_УЧЕТ
	Если ЗначениеЗаполнено(Валюта) Тогда
		Отбор = Новый Структура("Валюта, Контрагент", Валюта, Контрагент);
		АктуальныйКурс = РегистрыСведений.КурсыВалют.ПолучитьПоследнее().Курс;
		Если НЕ ЗначениеЗаполнено(АктуальныйКурс) Тогда
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не задан курс валюты для контрагента";
			Сообщение.Сообщить();
			
			Возврат;
		КонецЕсли;
		
		ВидСубконтоКонтрагент = ПланыВидовХарактеристик.ВидыСубконто.Контрагент;
		ВидСубконтоВалюта     = ПланыВидовХарактеристик.ВидыСубконто.Валюта;
		ВидСубконтоДокумент   = ПланыВидовХарактеристик.ВидыСубконто.Документ;

		СчетПокупатели    = ПланыСчетов.Управленческий.Покупатели;
		СчетПрибылиУбытки = ПланыСчетов.Управленческий.ПрибылиУбытки;
		
		Движения.Проводки.Очистить();
		
		Движения.Проводки.Записывать = Истина;
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Счет", СчетПокупатели);
		ЭлементБлокировки.УстановитьЗначение("Субконто1", Контрагент);
		ЭлементБлокировки.УстановитьЗначение("Субконто2", Валюта);
		Блокировка.Заблокировать();
		
		Проводка = Движения.Проводки.Добавить();
		Проводка.Период  = Дата;
		Проводка.СчетДт  = СчетПокупатели;
		Проводка.СчетКт  = СчетПрибылиУбытки;
		Проводка.СуммаУЕ = СуммаУслуг;
		Проводка.Сумма   = СуммаУслуг * АктуальныйКурс;
		Проводка.СубконтоДт[ВидСубконтоКонтрагент] = Контрагент;
		Проводка.СубконтоДт[ВидСубконтоВалюта]     = Валюта;
		Проводка.СубконтоДт[ВидСубконтоДокумент]   = Ссылка;
		
		Если Курс <> АктуальныйКурс Тогда
			ВыборкаДокументов = Документы.УстановкаКурсов.Выбрать(НачалоМесяца(Дата), КонецМесяца(Дата));
			Если ВыборкаДокументов.Следующий() Тогда
				ДокОбъект = ВыборкаДокументов.ПолучитьОбъект();
				
				НаборЗаписей = ДокОбъект.Движения.Проводки;
				НаборЗаписей.Прочитать();
				
				Для Каждого Запись Из НаборЗаписей Цикл
					Если Запись.СубконтоДт.Документ = Ссылка ИЛИ Запись.СубконтоКт.Документ = Ссылка Тогда
						НаборЗаписей.Удалить(Запись);
					КонецЕсли;
				КонецЦикла;
				
				НаборЗаписей.Записать();
			КонецЕсли;
			
			Курс = АктуальныйКурс;
			
			Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
#КонецОбласти
КонецПроцедуры

Процедура ДобавитьДвижениеОстатки(Номенклатура, Количество, Стоимость)
	Движение = Движения.ОстаткиНоменклатуры.ДобавитьРасход();
	Движение.Период       = Дата;
	Движение.Номенклатура = Номенклатура;
	Движение.Склад        = Склад;
	Движение.Количество   = Количество;
	Движение.Стоимость    = Стоимость;
КонецПроцедуры

Процедура ДобавитьДвижениеПродажи(Номенклатура, Аналог, Количество, Сумма, Себестоимость)
	Движение = Движения.Продажи.Добавить();
	Движение.Период        = Дата;
	Движение.Номенклатура  = Номенклатура;
	Движение.Аналог        = Аналог;
	Движение.Количество    = Количество;
	Движение.Сумма         = Сумма;
	Движение.Себестоимость = Себестоимость;
КонецПроцедуры
